---
kind: method
id: M:Autodesk.Revit.DB.PointOnFace.GetFaceReference
source: html/989b35e1-67d5-599d-5ec0-8d9587da11ee.htm
---
# Autodesk.Revit.DB.PointOnFace.GetFaceReference Method

Get a copy of the face reference.

## Syntax (C#)
```csharp
public Reference GetFaceReference()
```